In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name" : ["Harry", "Rohan", "Ali"],
    "marks": [10,20,30]
}

In [4]:
print(dict1)

{'name': ['Harry', 'Rohan', 'Ali'], 'marks': [10, 20, 30]}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

In [7]:
# Export to CSV
df.to_csv('file.csv')
# Export without index
df.to_csv('without_index_file.csv', index=False)

In [8]:
# Preview first n rows
df.head(3)

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

In [9]:
# Preview last n rows
df.tail(2)

    name  marks
1  Rohan     20
2    Ali     30

In [10]:
# Describe: Provide statistical information
df.describe()

       marks
count    3.0
mean    20.0
std     10.0
min     10.0
25%     15.0
50%     20.0
75%     25.0
max     30.0

# Importing Data from CSV

In [11]:
data = pd.read_csv('./data/winemag-data_first150k.csv')

In [12]:
data

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi
4,4,France,"This is the top wine from La Bégude, named aft...",La Brûlade,95,66.0,Provence,Bandol,NaN,Provence red blend,Domaine de la Bégude
...,...,...,...,...,...,...,...,...,...,...,...
150925,150925,Italy,Many people feel Fiano represents southern Ita...,NaN,91,20.0,Southern Italy,Fiano di Avellino,NaN,White Blend,Feudi di San Gregorio
150926,150926,France,"Offers an intriguing nose with ginger, lime an...",Cuvée Prestige,91,27.0,Champagne,Champagne,NaN,Champagne Blend,H.Germain
150927,150927,Italy,This classic example comes from a cru vineyard...,Terre di Dora,91,20.0,Southern Italy,Fiano di Avellino,NaN,White Blend,Terredora
150928,150928,France,"A perfect salmon shade, with scents of peaches...",Grand Brut Rosé,90,52.0,Champagne,Champagne,NaN,Champagne Blend,Gosset
150929,150929,Italy,More Pinot Grigios should taste like this. A r...,NaN,90,15.0,Northeastern Italy,Alto Adige,NaN,Pinot Grigio,Alois Lageder

In [13]:
# Print Specific Column
data.country

0             US
1          Spain
2             US
3             US
4         France
           ...
150925     Italy
150926    France
150927     Italy
150928    France
150929     Italy
Name: country, Length: 150930, dtype: object

In [14]:
# Print a Single Value
# Print First Record from the Country Series
data.country[0]

'US'

In [15]:
# Change Index Values
# data.index = ['index_1', 'index_2', 'index_3']

# Series

In [16]:
series = pd.Series(np.random.rand(34))

In [17]:
series

0     0.942032
1     0.209148
2     0.461355
3     0.922279
4     0.352521
5     0.415970
6     0.728694
7     0.640846
8     0.898309
9     0.714819
10    0.201845
11    0.992054
12    0.565315
13    0.155362
14    0.117232
15    0.406458
16    0.025471
17    0.597447
18    0.599024
19    0.714580
20    0.260001
21    0.936262
22    0.876176
23    0.917728
24    0.296998
25    0.997796
26    0.467086
27    0.078270
28    0.788569
29    0.045880
30    0.189720
31    0.557311
32    0.441855
33    0.263179
dtype: float64

In [18]:
type(series)

pandas.core.series.Series

# Data Frame

In [19]:
new_data_frame = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))
new_data_frame

            0         1         2         3         4
0    0.980043  0.647580  0.341698  0.670599  0.319040
1    0.597543  0.136312  0.655791  0.394031  0.426709
2    0.200394  0.701519  0.655798  0.440597  0.698034
3    0.921228  0.417724  0.354907  0.473931  0.480895
4    0.214904  0.771994  0.037428  0.639483  0.402867
..        ...       ...       ...       ...       ...
329  0.445413  0.235786  0.691653  0.722598  0.604226
330  0.485533  0.435724  0.900628  0.221899  0.794493
331  0.924939  0.558659  0.463011  0.353756  0.888240
332  0.971730  0.970833  0.245538  0.813291  0.136780
333  0.536599  0.620509  0.161814  0.576165  0.653306

[334 rows x 5 columns]

In [20]:
type(new_data_frame)

pandas.core.frame.DataFrame

In [21]:
new_data_frame.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.499819    0.527450    0.497457    0.516776    0.502536
std      0.286234    0.287541    0.284604    0.283516    0.290073
min      0.004570    0.003849    0.000220    0.005259    0.005152
25%      0.243208    0.270919    0.259042    0.287675    0.257269
50%      0.497708    0.554416    0.490237    0.515087    0.494538
75%      0.750932    0.788029    0.731188    0.765916    0.739554
max      0.997911    0.999406    0.994066    0.998242    0.999473

In [22]:
new_data_frame.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
new_data_frame.head()

          0         1         2         3         4
0  0.980043  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

In [24]:
new_data_frame[0][0] = "Random Name"

C:\Users\UsEr\AppData\Local\Temp\ipykernel_17336\2778953244.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_data_frame[0][0] = "Random Name"
C:\Users\UsEr\AppData\Local\Temp\ipykernel_17336\2778953244.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Random Name' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_data_frame[0][0] = "Random Name"

In [25]:
new_data_frame.head()

             0         1         2         3         4
0  Random Name  0.647580  0.341698  0.670599  0.319040
1     0.597543  0.136312  0.655791  0.394031  0.426709
2     0.200394  0.701519  0.655798  0.440597  0.698034
3     0.921228  0.417724  0.354907  0.473931  0.480895
4     0.214904  0.771994  0.037428  0.639483  0.402867

In [26]:
new_data_frame.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
new_data_frame.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [28]:
new_data_frame.columns

RangeIndex(start=0, stop=5, step=1)

In [29]:
new_data_frame.head()

             0         1         2         3         4
0  Random Name  0.647580  0.341698  0.670599  0.319040
1     0.597543  0.136312  0.655791  0.394031  0.426709
2     0.200394  0.701519  0.655798  0.440597  0.698034
3     0.921228  0.417724  0.354907  0.473931  0.480895
4     0.214904  0.771994  0.037428  0.639483  0.402867

In [30]:
new_data_frame.to_numpy()
new_data_frame[0][0] = 0.3
new_data_frame

            0         1         2         3         4
0         0.3  0.647580  0.341698  0.670599  0.319040
1    0.597543  0.136312  0.655791  0.394031  0.426709
2    0.200394  0.701519  0.655798  0.440597  0.698034
3    0.921228  0.417724  0.354907  0.473931  0.480895
4    0.214904  0.771994  0.037428  0.639483  0.402867
..        ...       ...       ...       ...       ...
329  0.445413  0.235786  0.691653  0.722598  0.604226
330  0.485533  0.435724  0.900628  0.221899  0.794493
331  0.924939  0.558659  0.463011  0.353756  0.888240
332   0.97173  0.970833  0.245538  0.813291  0.136780
333  0.536599  0.620509  0.161814  0.576165  0.653306

[334 rows x 5 columns]

In [31]:
new_data_frame.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.597543,0.200394,0.921228,0.214904,0.150751,0.056753,0.835812,0.096472,0.242677,...,0.463978,0.794667,0.430867,0.793182,0.427505,0.445413,0.485533,0.924939,0.97173,0.536599
1,0.64758,0.136312,0.701519,0.417724,0.771994,0.433556,0.088077,0.135015,0.722999,0.437746,...,0.74971,0.252074,0.806322,0.779034,0.840149,0.235786,0.435724,0.558659,0.970833,0.620509
2,0.341698,0.655791,0.655798,0.354907,0.037428,0.288767,0.918513,0.026736,0.41754,0.540118,...,0.91817,0.623084,0.886491,0.955645,0.686671,0.691653,0.900628,0.463011,0.245538,0.161814
3,0.670599,0.394031,0.440597,0.473931,0.639483,0.483758,0.07413,0.242632,0.408146,0.25123,...,0.305298,0.435006,0.775181,0.477473,0.415913,0.722598,0.221899,0.353756,0.813291,0.576165
4,0.31904,0.426709,0.698034,0.480895,0.402867,0.676957,0.901357,0.549249,0.005152,0.165518,...,0.151964,0.95875,0.076465,0.870736,0.374904,0.604226,0.794493,0.88824,0.13678,0.653306

In [32]:

new_data_frame.sort_index(axis=1 , ascending=False)

            4         3         2         1         0
0    0.319040  0.670599  0.341698  0.647580       0.3
1    0.426709  0.394031  0.655791  0.136312  0.597543
2    0.698034  0.440597  0.655798  0.701519  0.200394
3    0.480895  0.473931  0.354907  0.417724  0.921228
4    0.402867  0.639483  0.037428  0.771994  0.214904
..        ...       ...       ...       ...       ...
329  0.604226  0.722598  0.691653  0.235786  0.445413
330  0.794493  0.221899  0.900628  0.435724  0.485533
331  0.888240  0.353756  0.463011  0.558659  0.924939
332  0.136780  0.813291  0.245538  0.970833   0.97173
333  0.653306  0.576165  0.161814  0.620509  0.536599

[334 rows x 5 columns]

# Sorting

Use axis = 0 for Row
Use axis = 1 for Column

In [33]:

new_data_frame.sort_index(axis=1 , ascending=False)

            4         3         2         1         0
0    0.319040  0.670599  0.341698  0.647580       0.3
1    0.426709  0.394031  0.655791  0.136312  0.597543
2    0.698034  0.440597  0.655798  0.701519  0.200394
3    0.480895  0.473931  0.354907  0.417724  0.921228
4    0.402867  0.639483  0.037428  0.771994  0.214904
..        ...       ...       ...       ...       ...
329  0.604226  0.722598  0.691653  0.235786  0.445413
330  0.794493  0.221899  0.900628  0.435724  0.485533
331  0.888240  0.353756  0.463011  0.558659  0.924939
332  0.136780  0.813291  0.245538  0.970833   0.97173
333  0.653306  0.576165  0.161814  0.620509  0.536599

[334 rows x 5 columns]

In [34]:
new_data_frame.head()

          0         1         2         3         4
0       0.3  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

In [35]:
type(new_data_frame[0])

pandas.core.series.Series

In [36]:
newdf2 = new_data_frame
newdf2[0][0]= 934347

In [37]:
new_data_frame

            0         1         2         3         4
0      934347  0.647580  0.341698  0.670599  0.319040
1    0.597543  0.136312  0.655791  0.394031  0.426709
2    0.200394  0.701519  0.655798  0.440597  0.698034
3    0.921228  0.417724  0.354907  0.473931  0.480895
4    0.214904  0.771994  0.037428  0.639483  0.402867
..        ...       ...       ...       ...       ...
329  0.445413  0.235786  0.691653  0.722598  0.604226
330  0.485533  0.435724  0.900628  0.221899  0.794493
331  0.924939  0.558659  0.463011  0.353756  0.888240
332   0.97173  0.970833  0.245538  0.813291  0.136780
333  0.536599  0.620509  0.161814  0.576165  0.653306

[334 rows x 5 columns]

# Copying the DataFrame Right Way

In [38]:
df3 = new_data_frame.copy()
df3.head()

          0         1         2         3         4
0    934347  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

In [39]:
df3[0][0] = 9
new_data_frame.head()

C:\Users\UsEr\AppData\Local\Temp\ipykernel_17336\3125743126.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3[0][0] = 9
C:\Users\UsEr\AppData\Local\Temp\ipykernel_17336\3125743126.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[0][0] = 9

          0         1         2         3         4
0    934347  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

In [40]:
df3.head()

          0         1         2         3         4
0         9  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

# Loc

We can access a specific column by row and column. Row and

In [41]:
df3.loc[0,0] = 654
df3.head()

          0         1         2         3         4
0       654  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

## Updating Colmn Label

In [42]:
df3.columns = list("ABCDE")
df3.head()

          A         B         C         D         E
0       654  0.647580  0.341698  0.670599  0.319040
1  0.597543  0.136312  0.655791  0.394031  0.426709
2  0.200394  0.701519  0.655798  0.440597  0.698034
3  0.921228  0.417724  0.354907  0.473931  0.480895
4  0.214904  0.771994  0.037428  0.639483  0.402867

## Accesing unavailable columns creates a new columns

In [43]:
df3.loc[0,0] = 654
df3.head(3)

          A         B         C         D         E      0
0       654  0.647580  0.341698  0.670599  0.319040  654.0
1  0.597543  0.136312  0.655791  0.394031  0.426709    NaN
2  0.200394  0.701519  0.655798  0.440597  0.698034    NaN

In [44]:
df3.loc[0, 'A'] = 654
df3.head(3)

          A         B         C         D         E      0
0       654  0.647580  0.341698  0.670599  0.319040  654.0
1  0.597543  0.136312  0.655791  0.394031  0.426709    NaN
2  0.200394  0.701519  0.655798  0.440597  0.698034    NaN

# Drop Column/Row
axis = 1 is equivilent to column
axis = 0 is equivilent to row

In [45]:
df3 = df3.drop((0,0), axis=1)
df3.head()

KeyError: '[(0, 0)] not found in axis'

In [ ]:
df3 = df3.drop(0, axis=1)
df3.head()

# Accessing Specific Rows & Columns
df3.loc[rows, columns]

In [46]:
df3.loc[[1,2], ['A', 'E']]

          A         E
1  0.597543  0.426709
2  0.200394  0.698034

In [46]:
df3.loc[[1,2], ['A', 'E']]

          A         E
1  0.597543  0.426709
2  0.200394  0.698034

In [47]:
df3.head()

          A         B         C         D         E      0
0       654  0.647580  0.341698  0.670599  0.319040  654.0
1  0.597543  0.136312  0.655791  0.394031  0.426709    NaN
2  0.200394  0.701519  0.655798  0.440597  0.698034    NaN
3  0.921228  0.417724  0.354907  0.473931  0.480895    NaN
4  0.214904  0.771994  0.037428  0.639483  0.402867    NaN

In [48]:
df3.loc[:, :]

            A         B         C         D         E      0
0         654  0.647580  0.341698  0.670599  0.319040  654.0
1    0.597543  0.136312  0.655791  0.394031  0.426709    NaN
2    0.200394  0.701519  0.655798  0.440597  0.698034    NaN
3    0.921228  0.417724  0.354907  0.473931  0.480895    NaN
4    0.214904  0.771994  0.037428  0.639483  0.402867    NaN
..        ...       ...       ...       ...       ...    ...
329  0.445413  0.235786  0.691653  0.722598  0.604226    NaN
330  0.485533  0.435724  0.900628  0.221899  0.794493    NaN
331  0.924939  0.558659  0.463011  0.353756  0.888240    NaN
332   0.97173  0.970833  0.245538  0.813291  0.136780    NaN
333  0.536599  0.620509  0.161814  0.576165  0.653306    NaN

[334 rows x 6 columns]

In [51]:
df3.loc[[1,2], :]

          A         B         C         D         E   0
1  0.597543  0.136312  0.655791  0.394031  0.426709 NaN
2  0.200394  0.701519  0.655798  0.440597  0.698034 NaN

In [55]:
df3.loc[(df3['A'] < 0.3)]

            A         B         C         D         E   0
2    0.200394  0.701519  0.655798  0.440597  0.698034 NaN
4    0.214904  0.771994  0.037428  0.639483  0.402867 NaN
5    0.150751  0.433556  0.288767  0.483758  0.676957 NaN
6    0.056753  0.088077  0.918513  0.074130  0.901357 NaN
8    0.096472  0.722999  0.417540  0.408146  0.005152 NaN
..        ...       ...       ...       ...       ...  ..
317  0.096351  0.015024  0.556505  0.769408  0.014019 NaN
319  0.108446  0.446787  0.464985  0.429056  0.854784 NaN
320  0.111183  0.895168  0.733781  0.083971  0.761237 NaN
321  0.029307  0.976978  0.579316  0.691093  0.132553 NaN
322  0.262156  0.568000  0.453860  0.411096  0.630642 NaN

[102 rows x 6 columns]

In [56]:
df3.loc[(df3['A'] < 0.3) & df3['C'] > 0.1]

            A         B         C         D         E   0
2    0.200394  0.701519  0.655798  0.440597  0.698034 NaN
4    0.214904  0.771994  0.037428  0.639483  0.402867 NaN
5    0.150751  0.433556  0.288767  0.483758  0.676957 NaN
6    0.056753  0.088077  0.918513  0.074130  0.901357 NaN
8    0.096472  0.722999  0.417540  0.408146  0.005152 NaN
..        ...       ...       ...       ...       ...  ..
317  0.096351  0.015024  0.556505  0.769408  0.014019 NaN
319  0.108446  0.446787  0.464985  0.429056  0.854784 NaN
320  0.111183  0.895168  0.733781  0.083971  0.761237 NaN
321  0.029307  0.976978  0.579316  0.691093  0.132553 NaN
322  0.262156  0.568000  0.453860  0.411096  0.630642 NaN

[102 rows x 6 columns]

# iLoc - Use when want to use Index
Use iloc when want to retrive based on index.
For example accessing df3.iloc[row, column]
This gives a specific value.

In [57]:
df3.iloc[0,4]

0.31904027659188794

In [61]:
df3.iloc[[0,5],[0,4]]

          A         E
0       654  0.319040
5  0.150751  0.676957

In [62]:
df3.iloc[:,:]

            A         B         C         D         E      0
0         654  0.647580  0.341698  0.670599  0.319040  654.0
1    0.597543  0.136312  0.655791  0.394031  0.426709    NaN
2    0.200394  0.701519  0.655798  0.440597  0.698034    NaN
3    0.921228  0.417724  0.354907  0.473931  0.480895    NaN
4    0.214904  0.771994  0.037428  0.639483  0.402867    NaN
..        ...       ...       ...       ...       ...    ...
329  0.445413  0.235786  0.691653  0.722598  0.604226    NaN
330  0.485533  0.435724  0.900628  0.221899  0.794493    NaN
331  0.924939  0.558659  0.463011  0.353756  0.888240    NaN
332   0.97173  0.970833  0.245538  0.813291  0.136780    NaN
333  0.536599  0.620509  0.161814  0.576165  0.653306    NaN

[334 rows x 6 columns]

In [63]:
df3.iloc[[0,5],:]

          A         B         C         D         E      0
0       654  0.647580  0.341698  0.670599  0.319040  654.0
5  0.150751  0.433556  0.288767  0.483758  0.676957    NaN

In [64]:
df3.drop([0])

            A         B         C         D         E   0
1    0.597543  0.136312  0.655791  0.394031  0.426709 NaN
2    0.200394  0.701519  0.655798  0.440597  0.698034 NaN
3    0.921228  0.417724  0.354907  0.473931  0.480895 NaN
4    0.214904  0.771994  0.037428  0.639483  0.402867 NaN
5    0.150751  0.433556  0.288767  0.483758  0.676957 NaN
..        ...       ...       ...       ...       ...  ..
329  0.445413  0.235786  0.691653  0.722598  0.604226 NaN
330  0.485533  0.435724  0.900628  0.221899  0.794493 NaN
331  0.924939  0.558659  0.463011  0.353756  0.888240 NaN
332   0.97173  0.970833  0.245538  0.813291  0.136780 NaN
333  0.536599  0.620509  0.161814  0.576165  0.653306 NaN

[333 rows x 6 columns]

In [68]:
df3.drop(['A', 0], axis=1, inplace=True)

            B         C         D         E
0    0.647580  0.341698  0.670599  0.319040
1    0.136312  0.655791  0.394031  0.426709
2    0.701519  0.655798  0.440597  0.698034
3    0.417724  0.354907  0.473931  0.480895
4    0.771994  0.037428  0.639483  0.402867
..        ...       ...       ...       ...
329  0.235786  0.691653  0.722598  0.604226
330  0.435724  0.900628  0.221899  0.794493
331  0.558659  0.463011  0.353756  0.888240
332  0.970833  0.245538  0.813291  0.136780
333  0.620509  0.161814  0.576165  0.653306

[334 rows x 4 columns]

In [68]:
df3.drop(['A', 0], axis=1)

            B         C         D         E
0    0.647580  0.341698  0.670599  0.319040
1    0.136312  0.655791  0.394031  0.426709
2    0.701519  0.655798  0.440597  0.698034
3    0.417724  0.354907  0.473931  0.480895
4    0.771994  0.037428  0.639483  0.402867
..        ...       ...       ...       ...
329  0.235786  0.691653  0.722598  0.604226
330  0.435724  0.900628  0.221899  0.794493
331  0.558659  0.463011  0.353756  0.888240
332  0.970833  0.245538  0.813291  0.136780
333  0.620509  0.161814  0.576165  0.653306

[334 rows x 4 columns]

## Inplace - Update the Origional One
For example `df3 = df3.drop(['A'], axis=1)`

In [69]:
df3.drop(['A', 0], axis=1, inplace=True)

# Reset Index
It resets the indexes to start from 1
`drop=True` means drop the current index column
`inplace` means update the origional dataframe

In [72]:
df3.reset_index(drop = True, inplace=True)

In [73]:
df3

            B         C         D         E
0    0.647580  0.341698  0.670599  0.319040
1    0.136312  0.655791  0.394031  0.426709
2    0.701519  0.655798  0.440597  0.698034
3    0.417724  0.354907  0.473931  0.480895
4    0.771994  0.037428  0.639483  0.402867
..        ...       ...       ...       ...
329  0.235786  0.691653  0.722598  0.604226
330  0.435724  0.900628  0.221899  0.794493
331  0.558659  0.463011  0.353756  0.888240
332  0.970833  0.245538  0.813291  0.136780
333  0.620509  0.161814  0.576165  0.653306

[334 rows x 4 columns]

# Is Null

In [75]:
df3['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: B, Length: 334, dtype: bool

# Update Value to None

In [76]:
df3['B'] = None

In [77]:
df3

        B         C         D         E
0    None  0.341698  0.670599  0.319040
1    None  0.655791  0.394031  0.426709
2    None  0.655798  0.440597  0.698034
3    None  0.354907  0.473931  0.480895
4    None  0.037428  0.639483  0.402867
..    ...       ...       ...       ...
329  None  0.691653  0.722598  0.604226
330  None  0.900628  0.221899  0.794493
331  None  0.463011  0.353756  0.888240
332  None  0.245538  0.813291  0.136780
333  None  0.161814  0.576165  0.653306

[334 rows x 4 columns]

In [78]:
df3.loc[:, ['B']] = None

In [79]:
df3

        B         C         D         E
0    None  0.341698  0.670599  0.319040
1    None  0.655791  0.394031  0.426709
2    None  0.655798  0.440597  0.698034
3    None  0.354907  0.473931  0.480895
4    None  0.037428  0.639483  0.402867
..    ...       ...       ...       ...
329  None  0.691653  0.722598  0.604226
330  None  0.900628  0.221899  0.794493
331  None  0.463011  0.353756  0.888240
332  None  0.245538  0.813291  0.136780
333  None  0.161814  0.576165  0.653306

[334 rows x 4 columns]

In [83]:
df3['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
329    True
330    True
331    True
332    True
333    True
Name: B, Length: 334, dtype: bool

# Dropna

In [84]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],

                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],

                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),

                            pd.NaT]})

In [85]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25